{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Economy",
    "1": "Education",
    "2": "Entertainment",
    "3": "Environment",
    "4": "Food",
    "5": "Health",
    "6": "Politics",
    "7": "Sports",
    "8": "Technology",
    "9": "Travel"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Economy": 0,
    "Education": 1,
    "Entertainment": 2,
    "Environment": 3,
    "Food": 4,
    "Health": 5,
    "Politics": 6,
    "Sports": 7,
    "Technology": 8,
    "Travel": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
